Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Single fully tempered glass complying with Category II of CPSC 16 CFR Part 1201 or Class A of ANSI Z97.1 shall be permitted to be used in handrails and guardrails where there is no walking surface beneath them or the walking surface is permanently protected from the risk of falling glass.
fr_ca: Un verre monolithique entièrement trempé conforme à la catégorie II de la norme CPSC 16 CFR Part 1201 ou à la classe A de la norme ANSI Z97.1 peut être utilisé dans les mains courantes et les garde-corps lorsqu’aucune surface de circulation ne se trouve sous ceux-ci ou lorsque la surface de circulation est protégée en permanence contre le risque de chute de verre.

source: Single- or multiple-station smoke alarms shall be provided in Groups I-1, R-2, R-3 and R-4 in accordance with Section 907.2.11.
fr_ca: Des détecteurs de fumée à poste unique ou à postes multiples doivent être prévus dans les groupes I-1, R-2, R-3 et R-4 selon la section 907.2.11.

source: Sinks shall be provided with waste outlets having a diameter not less than 11/2 inches (38 mm).
fr_ca: Les éviers doivent être munis de sorties d'évacuation d'un diamètre d'au moins 11/2 po (38 mm).

source: Sinks shall comply with Section 1103.12.4.
fr_ca: Les éviers doivent être conformes à la section 1103.12.4.

source: Sinks shall conform to ASME A112.19.1/CSA B45.2, ASME A112.19.2/CSA B45.1, ASME A112.19.3/CSA B45.4 or CSA B45.5/IAPMO Z124.
fr_ca: Les éviers doivent être conformes aux normes ASME A112.19.1/CSA B45.2, ASME A112.19.2/CSA B45.1, ASME A112.19.3/CSA B45.4 ou CSA B45.5/IAPMO Z124.

source: Sites, buildings, structures, facilities, elements and spaces shall be exempt from this chapter to the extent specified in this section.
fr_ca: Les sites, les bâtiments, les constructions, les installations, les éléments et les espaces sont exemptés du présent chapitre dans la mesure spécifiée à la présente section.

source: Sites, buildings, structures, facilities, elements and spaces, temporary or permanent, shall be accessible to individuals with disabilities.
fr_ca: Les sites, les bâtiments, les constructions, les installations, les éléments et les espaces, temporaires ou permanents, doivent être accessibles aux personnes en situation d'handicap.

source: Skylights and other penetrations through a fire-resistance-rated roof deck or slab are permitted to be unprotected, provided that the structural integrity of the fire-resistance-rated roof assembly is maintained.
fr_ca: Les puits de lumière et autres traversées d’un platelage ou d’une dalle de couverture présentant une résistance au feu sont autorisés à ne pas être protégés, à condition que l’intégrité structurale de l’assemblage de couverture présentant une résistance au feu soit maintenue.

source: Sliding hoistway and car doors shall comply with Sections 407.3.1 through 407.3.3, and 408.3.3.
fr_ca: Les portes coulissantes de la cage et de la cabine d'ascenseur doivent être conformes aux sections 407.3.1 à 407.3.3 et 408.3.3.

source: Smoke alarms shall be installed in the following locations:
fr_ca: Des détecteurs de fumée doivent être installés aux endroits suivants :

source: Smoke alarms shall be listed in accordance with UL 217.
fr_ca: Les détecteurs de fumée doivent être répertoriés conformément à la norme UL 217.

source: Smoke alarms shall be provided in accordance with this section.
fr_ca: Des détecteurs de fumée doivent être prévus conformément à la présente section.

source: Smoke alarms shall be provided in dwelling units.
fr_ca: Des détecteurs de fumée doivent être prévus dans les logements.

source: Smoke alarms shall comply with NFPA 72 and Section R314.
fr_ca: Les détecteurs de fumée doivent être conformes à la norme NFPA 72 et à la section R314.

source: Smoke alarms shall not be installed in the following locations unless this would prevent placement of a smoke alarm in a location required by Section R314.3.
fr_ca: Les détecteurs de fumée ne doivent pas être installés aux endroits suivants, sauf si cela empêcherait le placement d'un détecteur de fumée à un endroit requis par la section R314.3.

source: Smoke alarms shall receive their primary power from the building wiring where such wiring is served from a commercial source and, where primary power is interrupted, shall receive power from a battery.
fr_ca: Les détecteurs de fumée doivent être alimentés en électricité primaire par le câblage du bâtiment lorsque ce câblage est alimenté par une source commerciale et, en cas d'interruption de l'alimentation primaire, ils doivent être alimentés par une batterie.

source: Smoke and draft control doors complying only with UL 1784 shall be permitted to show the letter “S” on the manufacturer's labeling.
fr_ca: Les portes de contrôle de la fumée et des courants d’air conformes uniquement à la norme UL 1784 peuvent porter la lettre « S » sur l'étiquetage du fabricant.

source: Smoke barriers constructed of minimum 0.10-inch-thick (2.5 mm) steel in Group I-3 buildings.
fr_ca: Les séparations pare-fumée construites en acier d'une épaisseur minimale de 0,10 pouce (2,5 mm) dans les bâtiments du groupe I-3.

source: Smoke barriers shall be of materials permitted by the building type of construction.
fr_ca: Les séparations pare-fumée doivent être constituées de matériaux autorisés pour le type de construction du bâtiment.

source: Smoke barriers shall be provided in Group I-1, Condition 2 to subdivide every story used by persons receiving care, treatment or sleeping and to provide other stories with an occupant load of 50 or more persons, into not fewer than two smoke compartments.
fr_ca: Les séparations pare-fumée doivent être prévues dans les établissements du groupe I-1, condition 2, afin de subdiviser chaque étage utilisé par des personnes recevant des soins, des traitements ou dormant sur place et les autres étages ayant une charge d’occupants de 50 personnes ou plus en au moins deux compartiments coupe-fumée.

source: Smoke barriers shall form an effective membrane continuous from the top of the foundation or floor/ceiling assembly below to the underside of the floor or roof sheathing, deck or slab above, including continuity through concealed spaces, such as those found above suspended ceilings, and interstitial structural and mechanical spaces.
fr_ca: Les séparations pare-fumée doivent former une membrane efficace et continue depuis le sommet des fondations ou de l’assemblage de plancher/plafond situé en dessous jusqu’à la sous-face du revêtement de plancher ou de la couverture, du platelage ou de la dalle situé au-dessus, y compris une continuité à travers les espaces dissimulés, tels que ceux situés au-dessus des plafonds suspendus, ainsi que les espaces interstitiels structuraux et mécaniques.

source: Smoke chamber wall thicknessUnlined walls
fr_ca: Épaisseur de la paroi de la chambre à fumée Parois non revêtues

source: Smoke chamber walls shall be constructed of solid masonry units, hollow masonry units grouted solid, stone or concrete.
fr_ca: Les murs de la chambre à fumée doivent être construits en éléments de maçonnerie pleins, en éléments de maçonnerie creux jointoyés, en pierre ou en béton.

source: Smoke control in accordance with Section 909 shall be provided to maintain the smoke layer interface not less than 6 feet (1829 mm) above the highest level of the assembly seating or above the top of the proscenium opening where a proscenium wall is provided in compliance with Section 410.2.4.
fr_ca: Le contrôle des fumées, conformément à la section 909, doit être assuré de manière à maintenir l’interface de la couche de fumée à au moins 6 pieds (1 829 mm) au-dessus du niveau le plus élevé des places assises pour l’assemblée ou au-dessus du sommet de l’ouverture de scène lorsqu’un mur de séparation de scène est prévu conformément à la section 410.2.4.

source: Smoke detection is not required for exterior balconies.
fr_ca: La détection de fumée n'est pas exigée pour les balcons extérieurs.

source: Smoke detection shall be provided in accordance with Section 907.2.13.1.
fr_ca: Un système de détection de fumée doit être installé conformément à l’article 907.2.13.1.

source: Smoke detectors shall be installed in the locations specified in Section R314.3.
fr_ca: Les détecteurs de fumée doivent être installés aux endroits spécifiés à la section R314.3.

source: Smoke detectors shall be listed in accordance with UL 268.
fr_ca: Les détecteurs de fumée doivent être répertoriés conformément à la norme UL 268.

source: Smoke partitions installed as required elsewhere in the code shall comply with this section.
fr_ca: Les cloisons pare-fumée installées comme requis ailleurs dans le code doivent être conformes à la présente section.

source: Smoke partitions shall extend from the top of the foundation or floor below to the underside of the floor or roof sheathing, deck or slab above or to the underside of the ceiling above where the ceiling membrane is constructed to limit the transfer of smoke.
fr_ca: Les cloisons pare-fumée doivent s’étendre depuis le sommet des fondations ou du plancher situé en dessous jusqu’à la sous-face du revêtement de plancher ou de couverture, du platelage ou de la dalle situé au-dessus, ou jusqu’à la sous-face du plafond situé au-dessus lorsque la membrane du plafond est construite de manière à limiter la propagation de la fumée.

source: Smoke-barrier assemblies used to separate smoke compartments shall form an effective membrane enclosure that is continuous from an outside wall or smoke barrier wall to an outside wall or another smoke barrier wall and to the horizontal assemblies.
fr_ca: Les assemblages formant des séparations pare-fumée utilisés pour séparer les compartiments coupe-fumée doivent former une enceinte constituant une membrane efficace et continue, depuis un mur extérieur ou un mur formant une séparation pare-fumée jusqu’à un mur extérieur ou un autre mur formant une séparation pare-fumée, et jusqu’aux assemblages horizontaux.

source: Smoke-barrier walls are not required in interstitial spaces where such spaces are designed and constructed with ceilings or exterior walls that provide resistance to the passage of fire and smoke equivalent to that provided by the smoke-barrier walls.
fr_ca: Les murs formant des séparations pare-fumée ne sont pas requis dans les espaces interstitiels lorsque ces espaces sont conçus et construits avec des plafonds ou des murs extérieurs qui offrent une résistance au passage du feu et de la fumée équivalente à celle offerte par les murs formant des séparations pare-fumée.

source: Smoke-barrier walls used to enclose areas of refuge in accordance with Section 1009.6.4 or to enclose elevator lobbies in accordance with Section 405.4.3, 3007.6.2, or 3008.6.2 shall comply with Section 709.4.2.
fr_ca: Les parois pare-fumée utilisées pour délimiter les aires de refuge conformément à la section 1009.6.4 ou pour délimiter les halls d’ascenseur conformément à la section 405.4.3, 3007.6.2 ou 3008.6.2 doivent être conformes à la section 709.4.2.

source: Smoke-barrier walls used to enclose areas of refuge in accordance with Section 1009.6.4, or to enclose elevator lobbies in accordance with Section 405.4.3, 3007.6.2, or 3008.6.2, shall form an effective membrane enclosure that terminates at a fire barrier wall having a level of fire protection rating not less than 1 hour, another smoke barrier wall or an outside wall.
fr_ca: Les murs formant des séparations pare-fumée utilisés pour délimiter les aires de refuge conformément à la section 1009.6.4 ou les halls d’ascenseur conformément aux sections 405.4.3, 3007.6.2 ou 3008.6.2 doivent former une enceinte constituant une membrane efficace qui se termine à un mur de barrière coupe-feu présentant un degré de résistance au feu d’au moins 1 heure, à un autre mur formant une séparation pare-fumée ou à un mur extérieur.

source: Smoke-barrier walls used to separate smoke compartments shall comply with Section 709.4.1.
fr_ca: Les parois pare-fumée utilisées pour séparer les compartiments coupe-fumée doivent être conformes à la section 709.4.1.

source: Social rehabilitation facilities
fr_ca: Établissements de réadaptation sociale

source: Solid masonry units or hollow masonry units grouted solid withnot less than 4-inch nominal thickness.
fr_ca: Unités de maçonnerie pleines ou unités de maçonnerie creuses jointoyées pleines d'une épaisseur nominale d'au moins 4 po.

source: Space heating systems are not required for:
fr_ca: Les systèmes de chauffage des locaux ne sont pas exigés pour :

source: Spaces accessed only by ladders, catwalks, crawl spaces, freight elevators or very narrow passageways are not required to comply with this chapter.
fr_ca: Les espaces accessibles uniquement par des échelles, des passerelles, des vides sanitaires, des monte-charges ou des passages très étroits ne sont pas tenus de se conformer à ce chapitre.

source: Spaces and elements within employee work areas shall only be required to comply with Sections 907.5.2.3.1, 1009 and 1104.3.1 and shall be designed and constructed so that individuals with disabilities can approach, enter and exit the work area.
fr_ca: Les espaces et les éléments situés dans les zones de travail des employés doivent uniquement être conformes aux sections 907.5.2.3.1, 1009 et 1104.3.1 et doivent être conçus et construits de manière à permettre aux personnes handicapées d’accéder à la zone de travail, d’y entrer et d’en sortir.

source: Spaces frequented only by service personnel for maintenance, repair or occasional monitoring of equipment are not required to comply with this chapter.
fr_ca: Les espaces fréquentés uniquement par le personnel d'entretien pour l'entretien, la réparation ou la surveillance occasionnelle de l'équipement ne sont pas tenus de se conformer à ce chapitre.

source: Spaces or areas in telecommunications buildings used exclusively for telecommunications equipment, associated electrical power distribution equipment, batteries and standby engines, provided that those spaces or areas are equipped throughout with an automatic smoke detection system in accordance with Section 907.2 and are separated from the remainder of the building by not less than 1-hour fire barriers constructed in accordance with Section 707 or not less than 2-hour horizontal assemblies constructed in accordance with Section 711, or both.
fr_ca: Les espaces ou aires des bâtiments de télécommunications utilisés exclusivement pour l’équipement de télécommunications, l’équipement associé de distribution d’énergie électrique, les batteries et les moteurs de secours, à condition que ces espaces ou aires soient entièrement équipés d’un système automatique de détection d’incendie conformément à la section 907.2 et soient séparés du reste du bâtiment par des séparations coupe-feu d’au moins 1 heure construites conformément à la section 707 ou par des assemblages horizontaux d’au moins 2 heures construits conformément à la section 711, ou par les deux.

source: Spaces that do not provide a cooktop or conventional range shall be permitted to provide a clearance of 36 inches (915 mm) minimum.
fr_ca: Les espaces qui ne comportent pas de table de cuisson ni de cuisinière conventionnelle peuvent avoir un dégagement d’au moins 36 pouces (915 mm).

source: Spaces that do not provide a cooktop or conventional range shall not be required to provide an accessible work surface.
fr_ca: Les pièces qui ne sont pas équipées d'un plan de cuisson ou d'une cuisinière classique ne sont pas tenues d'offrir une surface de travail accessible.

source: Spaces under grandstands or bleachers shall be separated by fire barriers complying with Section 707 and horizontal assemblies complying with Section 711 with not less than 1-hour fire-resistance-rated construction.
fr_ca: Les espaces situés sous les gradins ou les estrades doivent être séparés par des séparations coupe-feu conformes à la section 707 et des ensembles horizontaux conformes à la section 711, présentant un degré de résistance au feu d’au moins 1 heure.

source: Spacing between individual characters shall be 10 percent minimum and 35 percent maximum of the character height.
fr_ca: L'espacement entre les caractères individuels doit être compris entre 10 pour cent et 35 pour cent de la hauteur des caractères.

source: Spacing between individual raised characters shall be 1/8 inch (3.2 mm) minimum measured at the top surface of the characters, 1/16 inch (1.6 mm) minimum measured at the base of the characters, and four times the raised character stroke width maximum.
fr_ca: L'espacement entre les caractères individuels en relief doit être d'au moins 1/8 po [3,2 mm] mesuré à la surface supérieure des caractères, d'au moins 1/16 po [1,6 mm] mesuré à la base des caractères, et d'au plus quatre fois la largeur de trait du caractère en relief.

source: Spacing shall be measured between the two closest points of adjacent characters within a message, excluding word spaces.
fr_ca: L'espacement doit être mesuré entre les deux points les plus proches de caractères adjacents dans un message, à l'exclusion des espaces entre les mots.

source: Special rooms and spaces required to be accessible by the scoping provisions adopted by the administrative authority shall comply with the applicable provisions of Chapter 8.
fr_ca: Les salles et espaces spéciaux qui doivent être accessibles en vertu des dispositions de portée adoptées par l'autorité administrative doivent être conformes aux dispositions applicables du chapitre 8.

source: Specialties requiring water and waste connections shall be submitted for approval.
fr_ca: Les équipements spéciaux nécessitant des raccordements d'eau et d'évacuation doivent être soumis pour approbation.

source: Spectators seated in a wheelchair space shall be afforded lines of sight over the heads of seated individuals in the first row in front of the wheelchair space location.
fr_ca: Les spectateurs assis dans un espace pour fauteuil roulant doivent avoir des lignes de vue au-dessus de la tête des personnes assises dans la première rangée devant l'emplacement de l'espace pour fauteuil roulant.

source: Spectators seated in a wheelchair space shall be afforded lines of sight over the shoulders and between the heads of seated individuals in the first row in front of the wheelchair space location.
fr_ca: Les spectateurs assis dans un espace pour fauteuil roulant doivent avoir des lignes de vue par-dessus les épaules et entre les têtes des personnes assises dans la première rangée devant l'emplacement de l'espace pour fauteuil roulant.

source: Spiral stairways.
fr_ca: Escaliers hélicoïdaux.

source: Sprinkler risers shall be placed in interior exit stairways and ramps that are remotely located in accordance with Section 1007.1.
fr_ca: Les colonnes montantes de gicleurs doivent être placées dans les escaliers et les rampes d’issue intérieurs situés à distance les uns des autres conformément à l’article 1007.1.

source: Sprinklers are not required for stages 1,000 square feet (93 m2) or less in area and 50 feet (15 240 mm) or less in height where curtains, scenery or other combustible hangings are not retractable vertically.
fr_ca: Les extincteurs automatiques ne sont pas requis pour les scènes d’une superficie d’au plus 1 000 pieds carrés (93 m²) et d’une hauteur d’au plus 50 pieds (15 240 mm) lorsque les rideaux, décors ou autres éléments suspendus combustibles ne sont pas rétractables verticalement.

source: Sprinklers are not required under stage areas less than 4 feet (1219 mm) in clear height that are utilized exclusively for storage of tables and chairs, provided that the concealed space is separated from the adjacent spaces by Type X gypsum board not less than 5/8-inch (15.9 mm) in thickness.
fr_ca: Les extincteurs automatiques ne sont pas requis sous les aires de scène d’une hauteur libre de moins de 4 pieds (1 219 mm) utilisées exclusivement pour l’entreposage de tables et de chaises, à condition que l’espace dissimulé soit séparé des espaces adjacents par des panneaux de gypse de type X d’une épaisseur d’au moins 5/8 pouce (15,9 mm).

source: Sprinklers are not required within portable orchestra enclosures on stages.
fr_ca: Des extincteurs automatiques ne sont pas requis dans les enceintes d’orchestre portatives sur les scènes.

source: Sprinklers shall be installed in dressing rooms, performer lounges, shops and storerooms accessory to such stages.
fr_ca: Des extincteurs automatiques doivent être installés dans les loges, les salons des artistes, les ateliers et les réserves accessoires à ces scènes.

source: Sprinklers shall be installed under the roof and gridiron and under all catwalks and galleries over the stage.
fr_ca: Des extincteurs automatiques doivent être installés sous le toit et le gril, ainsi que sous toutes les passerelles suspendues et les galeries au-dessus de la scène.

source: Stadiums, arenas and grandstands required to caption audible public announcements shall be in accordance with Section 907.5.2.2.4.
fr_ca: Les stades, les arénas et les gradins pour lesquels il est exigé que les annonces publiques audibles soient sous-titrées doivent être conformes à la section 907.5.2.2.4.

source: Stage areas shall be measured to include the entire performance area and adjacent backstage and support areas not separated from the performance area by fire-resistance-rated construction.
fr_ca: Les aires de scène doivent être mesurées de manière à inclure l’ensemble de l’aire de représentation ainsi que les aires adjacentes en coulisses et les aires de soutien qui ne sont pas séparées de l’aire de représentation par une construction présentant une résistance au feu.

source: Stage construction shall comply with Sections 410.2.1 through 410.2.7.
fr_ca: La construction de la scène doit être conforme aux sections 410.2.1 à 410.2.7.

source: Stage height shall be measured from the lowest point on the stage floor to the highest point of the roof or floor deck above the stage.
fr_ca: La hauteur de la scène doit être mesurée du point le plus bas du plancher de la scène au point le plus haut du toit ou du platelage au-dessus de la scène.

source: Stages and platforms constructed in accordance with Sections 410.2 and 410.3, respectively.
fr_ca: Estrades et plateformes construites conformément aux sections 410.2 et 410.3, respectivement.

source: Stages need not be constructed of the same materials as required for the type of construction provided that the construction complies with one of the following:
fr_ca: Les scènes n’ont pas à être construites avec les mêmes matériaux que ceux exigés pour le type de construction, à condition que la construction soit conforme à l’une des dispositions suivantes :

source: Stages of Type IIB or IV construction with a nominal 2-inch (51 mm) wood deck, provided that the stage is separated from other areas in accordance with Section 410.2.4.
fr_ca: Les scènes de type IIB ou IV peuvent être dotées d’un platelage en bois nominal de 2 pouces (51 mm), à condition que la scène soit séparée des autres aires conformément à la section 410.2.4.

source: Stages shall be constructed of materials as required for floors for the type of construction of the building in which such stages are located.
fr_ca: Les scènes doivent être construites avec les matériaux requis pour les planchers selon le type de construction du bâtiment dans lequel elles sont situées.

source: Stages shall be equipped with an automatic sprinkler system in accordance with Section 903.3.1.1.
fr_ca: Les scènes doivent être équipées d'un système d'extincteurs automatiques selon la section 903.3.1.1.
